{
    "name": "Rizki Perdana",
    "title": "Software Engineer",
    "contacts": [
        "+62 8960 1361 061",
        "perdana.rizki16@gmail.com",
        "https://www.linkedin.com/in/rizkiperdana",
        "https://rizperdana.github.io/",
        "Yogyakarta, Indonesia"
    ],
    "summary": "Software Engineer with 6+ years of experience delivering end-to-end web solutions. Expert in full-stack development, designing scalable APIs, crafting responsive UIs, and managing automated deployments. Proven track record in optimizing system performance and integrating AI to drive product innovation.",
    "experience": [
        {
            "company": "SourceSage",
            "title": "Software Engineer",
            "location": "Singapore",
            "period": "Mar 2022 - Present",
            "achievements": [
                "Architected end-to-end high-performance systems and RESTful APIs handling millions of daily B2B requests.",
                "Enhanced user interfaces and system architecture, increasing platform reliability by 40% and reducing latency by 60%.",
                "Integrated AI and large language models into core features to drive advanced automation and product intelligence.",
                "Streamlined CI/CD pipelines and automated deployment strategies, reducing delivery time by 50% and failures by 75%.",
                "Mentored engineering teams on full-stack best practices, coding standards, and scalable system design."
            ]
        },
        {
            "company": "PT. Gamatechno Indonesia",
            "title": "Software Engineer",
            "location": "Yogyakarta, Indonesia",
            "period": "Feb 2020 - Feb 2022",
            "achievements": [
                "Developed full-stack microservices and intuitive interfaces supporting diverse client applications and requirements.",
                "Engineered robust API contracts and deployment workflows that improved cross-team delivery efficiency by 30%.",
                "Synchronized frontend UI components with backend logic to ensure seamless integration and high-performance user experiences."
            ]
        },
        {
            "company": "PT. Diginet Media",
            "title": "Software Engineer",
            "location": "Yogyakarta, Indonesia",
            "period": "Sep 2014 - Jan 2016",
            "achievements": [
                "Built and deployed full-stack web applications featuring dynamic UIs and secure, scalable backend architectures.",
                "Developed RESTful API services and managed deployments for platforms supporting thousands of daily active users.",
                "Implemented secure authentication and data protection systems across the entire application stack."
            ]
        }
    ],
    "education": {
        "institution": "Yogyakarta State University",
        "degree": "Bachelor",
        "location": "Yogyakarta, Indonesia",
        "period": "2016 - 2020"
    },
    "skills": {
        "Programming Languages": "Python, Ruby, JavaScript, PHP, SQL, Shell Scripting",
        "Full-Stack Development": "UI/UX Implementation, REST APIs, Microservices, Event-Driven Architecture, Distributed Systems",
        "Database Technologies": "Relational Databases (MySQL, PostgreSQL), NoSQL, Data Modeling, Transaction Management",
        "Deployment & DevOps": "CI/CD Pipelines, Containerization, Infrastructure as Code, Cloud Platforms, Automated Testing",
        "AI & Intelligent Systems": "LLM Integration, Workflow Automation, NLP, Intelligent Systems Design",
        "Performance & Scalability": "System Optimization, Caching, Load Balancing, Performance Monitoring",
        "Development Practices": "Agile, Code Review, Technical Documentation, Security Best Practices"
    },
    "languages": [
        {
            "name": "English",
            "level": "Professional Proficiency"
        },
        {
            "name": "Indonesia",
            "level": "Native"
        }
    ]
}
